[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:66:55
                     id="diningcommonscode"
                     type="text"
                     isInvalid={Boolean(errors.diningcommonscode)}
-                    {...register("diningcommonscode", {
-                        required: "diningcommonscode is required."
-                    })}
+                    {...register("diningcommonscode", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /diningcommonscode is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:71:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.diningcommonscode?.message}
+                    {errors.diningcommonscode.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:83:45
                     id="station"
                     type="text"
                     isInvalid={Boolean(errors.station)}
-                    {...register("station", {
-                        required: "station is required."
-                    })}
+                    {...register("station", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /station is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
