[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:12:20
 export default function UCSBDiningCommonsMenuItemTable({
     menu,
     currentUser,
-    testIdPrefix = "UCSBDiningCommonsMenuItemTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: UCSB Dining Commons Table tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ucsbdiningcommonsmenuitems/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UCSB Dining Commons Table tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbdiningcommonsmenuitems/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:38:9
             accessor: 'id', // accessor is the "key" in the data
         },
 
-        {
-            Header: 'Name',
-            accessor: 'name',
-        },
+        {},
         {
             Header: 'Station',
killedBy: UCSB Dining Commons Table tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:42:9
             Header: 'Name',
             accessor: 'name',
         },
-        {
-            Header: 'Station',
-            accessor: 'station',
-        },
+        {},
         {
             Header: 'Dining Commons Code',
killedBy: UCSB Dining Commons Table tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:44:23
         },
         {
             Header: 'Station',
-            accessor: 'station',
+            accessor: "",
         },
         {
killedBy: UCSB Dining Commons Table tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-station"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:54:35
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix));
+        columns.push(ButtonColumn("", "danger", deleteCallback, testIdPrefix));
     } 
 
killedBy: UCSB Dining Commons Table tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
