[Killed] BooleanLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:7:72
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
+export default function UCSBDiningCommonsMenuItemCreatePage({storybook=true}) {
 
     const objectToAxiosParams = (menu) => ({
killedBy: UCSBDiningCommonsMenuItem tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdiningcommonsmenuitems"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:33
 
 export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (menu) => ({
-        url: "/api/ucsbdiningcommonsmenuitems/post",
-        method: "POST",
-        params: {
-         name: menu.name,
-         diningCommonsCode: menu.diningcommonscode,
-         station: menu.station
-        }
-      });
+    const objectToAxiosParams = () => undefined;
     
       const onSuccess = (menu) => {
killedBy: UCSBDiningCommonsMenuItem tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:19:35
         }
       });
     
-      const onSuccess = (menu) => {
-        toast(`New menu Created - id: ${menu.id} name: ${menu.name} diningCommonsCode: ${menu.diningCommonsCode} station: ${menu.station}`);
-      }
+      const onSuccess = (menu) => {}
     
       const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItem tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New menu Created - id: 3 name: South Coast Deli diningCommonsCode: dlg station: Sandwiches and Salads"

Number of calls: 0

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:36:36
         mutation.mutate(data);
       }
     
-      if (isSuccess && !storybook) {
-        return <Navigate to="/ucsbdiningcommonsmenuitems" />
-      }
+      if (isSuccess && !storybook) {}
     
       return (
killedBy: UCSBDiningCommonsMenuItem tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdiningcommonsmenuitems"}

Number of calls: 0
