[Killed] BlockStatement
src/main/utils/UCSBDiningCommonsMenuItemUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/ucsbdiningcommonsmenuitems",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 
killedBy: UCSBDiningCommonsMenuItemUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 17}, "url": "/api/ucsbdiningcommonsmenuitems"}
Received: undefined
