[Killed] ObjectLiteral
main/components/UCSBorganisation/UCSBorganisationForm.js:81:52
                     id="orgTranslation"
                     type="text"
                     isInvalid={Boolean(errors.orgTranslation)}
-                    {...register("orgTranslation", {
-                        required: "orgTranslation is required"
-                    })}
+                    {...register("orgTranslation", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBorganisationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /orgTranslation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
