[Killed] StringLiteral
main/components/UCSBorganisation/UCSBorganisationTable.js:12:20
 export default function UCSBorganisationTable({
     UCSBOrganization,
     currentUser,
-    testIdPrefix = "UCSBorganisationTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: UCSBorganisationIndexPage tests renders three restaurants correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBorganisationTable-cell-row-0-col-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/UCSBorganisation/UCSBorganisationTable.js:17:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/UCSBOrganization/edit/${cell.row.values.orgCode}`)
+        navigate(``)
     }
 
killedBy: UCSBorganisationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/UCSBOrganization/edit/GDSC"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/UCSBorganisation/UCSBorganisationTable.js:39:23
         },
         {
             Header: 'orgTranslationShort',
-            accessor: 'orgTranslationShort',
+            accessor: "",
         },
         {
killedBy: UCSBorganisationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Google Developer Student Clubs
Received:

[Killed] ArrowFunction
main/components/UCSBorganisation/UCSBorganisationTable.js:48:23
         {
             Header: 'inactive',
             // id: 'inactive',
-            accessor: row => String(row.inactive)
+            accessor: () => undefined
         }
     ];
killedBy: UCSBorganisationTable tests Delete button calls delete callback
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
