[Killed] BooleanLiteral
main/pages/UCSBorganisation/UCSBorganisationCreatePage.js:7:63
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBorganisationCreatePage({storybook=false}) {
+export default function UCSBorganisationCreatePage({storybook=true}) {
 
   const objectToAxiosParams = (UCSBorganisation) => ({
killedBy: UCSBorganisationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/UCSBOrganization"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBorganisation/UCSBorganisationCreatePage.js:9:31
 
 export default function UCSBorganisationCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (UCSBorganisation) => ({
-    url: "/api/UCSBOrganization/post",
-    method: "POST",
-    params: {
-     orgCode: UCSBorganisation.orgCode,
-     orgTranslationShort: UCSBorganisation.orgTranslationShort,
-     orgTranslation: UCSBorganisation.orgTranslation,
-     inactive: UCSBorganisation.inactive
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (UCSBorganisation) => {
killedBy: UCSBorganisationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
