[Killed] BooleanLiteral
main/pages/UCSBorganisation/UCSBorganisationEditPage.js:8:61
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBorganisationEditPage({storybook=false}) {
+export default function UCSBorganisationEditPage({storybook=true}) {
     let { orgCode } = useParams();
 
killedBy: UCSBorganisationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/UCSBOrganization"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBorganisation/UCSBorganisationEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (UCSBorganisation) => ({
-        url: "/api/UCSBOrganization",
-        method: "PUT",
-        params: {
-            orgCode: UCSBorganisation.orgCode,
-        },
-        data: {
-            orgCode: UCSBorganisation.orgCode,
-            orgTranslationShort: UCSBorganisation.orgTranslationShort,
-            orgTranslation: UCSBorganisation.orgTranslation,
-            inactive: UCSBorganisation.inactive,
-
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (UCSBorganisation) => {
killedBy: UCSBorganisationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBorganisation Updated - orgCode: GDSC orgTranslationShort: Google Developer Seniors Clubs orgTranslation: Google Developer Student Clubs inactive: false"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/UCSBorganisation/UCSBorganisationEditPage.js:25:14
         );
 
     const objectToAxiosPutParams = (UCSBorganisation) => ({
-        url: "/api/UCSBOrganization",
+        url: "",
         method: "PUT",
         params: {
killedBy: UCSBorganisationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBorganisation Updated - orgCode: GDSC orgTranslationShort: Google Developer Seniors Clubs orgTranslation: Google Developer Student Clubs inactive: false"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBorganisation/UCSBorganisationEditPage.js:30:15
         params: {
             orgCode: UCSBorganisation.orgCode,
         },
-        data: {
-            orgCode: UCSBorganisation.orgCode,
-            orgTranslationShort: UCSBorganisation.orgTranslationShort,
-            orgTranslation: UCSBorganisation.orgTranslation,
-            inactive: UCSBorganisation.inactive,
-
-        }
+        data: {}
     });
 
killedBy: UCSBorganisationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"orgCode\":\"UCSB-GDSC\",\"orgTranslationShort\":\"UCSB-Google Developer Student Clubs\",\"orgTranslation\":\"University of California Santa Barbara-Google Developer Student Clubs\",\"inactive\":\"true\"}"
Received: "{}"

[Killed] LogicalOperator
main/pages/UCSBorganisation/UCSBorganisationEditPage.js:65:21
             <div className="pt-2">
                 <h1>Edit UCSBorganisation</h1>
                 {
-                    UCSBorganisation && <UCSBorganisationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={UCSBorganisation} />
+                    UCSBorganisation || <UCSBorganisationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={UCSBorganisation} />
                 }
             </div>
killedBy: UCSBorganisationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBorganisationForm-orgCode"]

<body>
  <div />
</body>

[Killed] ConditionalExpression
main/pages/UCSBorganisation/UCSBorganisationEditPage.js:65:21
             <div className="pt-2">
                 <h1>Edit UCSBorganisation</h1>
                 {
-                    UCSBorganisation && <UCSBorganisationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={UCSBorganisation} />
+                    true
                 }
             </div>
killedBy: UCSBorganisationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBorganisationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
