[Killed] BlockStatement
main/pages/UCSBorganisation/UCSBorganisationIndexPage.js:22:32
             []
         );
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/UCSBOrganization/create"
-                    style={{ float: "right" }}
-                >
-                    Create UCSBorganisation
-                </Button>
-            )
-        } 
-    }
+    const createButton = () => {}
 
     return (
killedBy: UCSBorganisationIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBorganisation/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/UCSBorganisation/UCSBorganisationIndexPage.js:28:37
                 <Button
                     variant="primary"
                     href="/UCSBOrganization/create"
-                    style={{ float: "right" }}
+                    style={{ float: "" }}
                 >
                     Create UCSBorganisation
killedBy: UCSBorganisationIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
