[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:33
 
 export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (menu) => ({
-        url: "/api/ucsbdiningcommonsmenuitems/post",
-        method: "POST",
-        params: {
-         name: menu.name,
-         diningCommonsCode: menu.diningCommonsCode,
-         station: menu.station
-        }
-      });
+    const objectToAxiosParams = () => undefined;
     
       const onSuccess = (menu) => {
killedBy: UCSBDiningCommonsMenuItem tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
